//Курс: "Процедурное программирование и основы С++".
//Студент: Александр Юнин
//Выполнение практического задания ко второму уроку.


#include <iostream>
#include "task02.h"

using namespace std;

//Задание 2.1: ************************************************************

int Remainder();

void PrintNumber(int a){
    cout << a << endl;
}

//Конец Задания 2.1 *******************************************************

//Задание 3.1: ************************************************************

void Print(char str[]){
    cout << str << endl;
}

//Конец Задания 3.1 *******************************************************


int main()
{

//Задание 1: **************************************************************

    printf("Вывод Задания 1:\n");
    short x = 45000;
    unsigned char y = 1400;
    cout << x << endl;
    cout << y << endl;
    printf("\n");

    //Cообщения транслятора на экране:
    //предупреждение: implicit conversion from 'int' to 'short' changes value from 45000 to -20536
    //предупреждение: implicit conversion from 'int' to 'unsigned char' changes value from 1400 to 120

//Конец Задания 1 *********************************************************

//Задание 2.2: ************************************************************

    printf("Вывод Задания 2:\n");
    int a = 11;
    int b = 3;
    PrintNumber(Remainder(a, b));
    printf("\n");


//Конец Задания 2.2 *******************************************************

//Задание 3.2: ************************************************************

    printf("Вывод Задания 3:\n");
    char arr1[5] = {'s', 't', 'o', 'p'};
    char arr2[5] = {'s', 't'};
    Print(arr1);
    Print(arr2);


//Конец Задания 3.2 *******************************************************

return 0;
}
